tour_starter/app/controllers/tours_controller.rb

SELECT "tours".* FROM "tours" WHERE "tours"."id" = ? LIMIT 1  [["id", "1"]]
---
  def show
    @tour = Tour.find(params[:id])

INSERT INTO "tours" ("created_at", "end_time", "loc_lat", "loc_lon", "loc_name", "name", "prize", "start_time", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @tour = Tour.new(params[:tour])

    respond_to do |format|
      if @tour.save